package com.mredrock.cyxbs.freshman.viewmodel.bean

class DeliveryBean {

    /**
     * code : 200
     * info : ok
     * text : [{"name":"顺丰","message":[{"title":"樱花园6栋","detail":"位于樱花园6栋，进入老校门后上梯子左转朝里走，二教与马克思主义学院下面居民区石碑处，与京东快递相邻，收取时需提供手机尾号，收到短信后19：00前需前去领取快递，否则会退回包裹","photo":"3-3-1.JPG"}]},{"name":"京东","message":[{"title":"樱花园6栋","detail":"位于樱花园6栋，进入老校门后上梯子左转朝里走，二教与马克思主义学院下面居民区石碑处,与顺丰快递相邻， 收取时需提供取货码，营业时间9：00-19：00","photo":"3-3-2.jpg"}]},{"name":"圆通","message":[{"title":"樱花园6栋","detail":"位于樱花园6栋，顺丰和京东旁，进入老校门后上梯子左转朝里走，二教与马克思主义学院下面居民区石碑处，需提供取货码，营业时间：9：30-19：30","photo":"3-3-3.JPG"},{"title":"静园小区（校外）","detail":"老校门对面左手边大茶杯奶茶店旁斜坡上行右边巷子处可见菜鸟驿站","photo":""}]},{"name":"申通","message":[{"title":"学生公寓15栋","detail":"位于15栋，太极操场旁菜鸟驿站，凭货号在货架上找到自己的快递，收取快递时需提供学生卡或身份证等身份证。靠近6栋楼梯，21：30前可领取","photo":""},{"title":"静园小区（校外）","detail":"老校门出门后过马路，左转至大茶杯奶茶店旁斜坡上行，右边巷子处可见菜鸟驿站","photo":""}]},{"name":"韵达","message":[{"title":"学生公寓15栋","detail":"位于15栋，太极操场旁菜鸟驿站，凭货号在货架上找到自己的快递，收取快递时需提供学生卡或身份证等身份证。靠近6栋楼梯，21：30前可领取\r\n中通快递：位于学生公寓知行苑5栋背后超市旁边，收取时需提供取货码，营业时间：9：00-21：00\r\n","photo":"3-3-7.JPG"},{"title":"静园小区（校外）","detail":"老校门出门后过马路，左转至大茶杯奶茶店旁斜坡上行，右边巷子处可见菜鸟驿站","photo":""}]},{"name":"邮政EMS","message":[{"title":"香樟园四号","detail":"邮政：香樟园四号，老校门楼梯上公共厕所旁边的自动取货机器，根据取货码收取","photo":"3-3-9.JPG"},{"title":"香樟园四号","detail":"EMS：香樟园四号，老校门楼梯上公共厕所旁边的自动取货机器，提供身份证和提货码在取货机旁的房间里收取快递，营业时间：9:00-11:30;14：00-17：00","photo":"3-3-13.jpg"}]},{"name":"百世","message":[{"title":"阳光图文","detail":"老校门进门后左走五十米，阳光图文附近，收取时需提供货号，21：00前可以收取快递。","photo":"3-3-10.JPG"}]},{"name":"菜鸟驿站","message":[{"title":"静园小区（校外）","detail":"老校门对面左手边大茶杯奶茶店旁斜坡上行右边巷子处可见菜鸟驿站（常投递快递有：申通、圆通、中通、韵达）","photo":"3-3-11.JPG"}]},{"name":"中通","message":[{"title":"学生公寓5栋","detail":"灯光篮球场附近学生公寓五栋背后，飞越电脑旁。凭取货码取货。营业时间：09：00-21：00","photo":"3-3-12.png"}]}]
     */

    var code: Int = 0
    var info: String? = null
    var text: List<TextBean>? = null

    class TextBean {
        /**
         * name : 顺丰
         * message : [{"title":"樱花园6栋","detail":"位于樱花园6栋，进入老校门后上梯子左转朝里走，二教与马克思主义学院下面居民区石碑处，与京东快递相邻，收取时需提供手机尾号，收到短信后19：00前需前去领取快递，否则会退回包裹","photo":"3-3-1.JPG"}]
         */

        var name: String? = null
        var message: List<MessageBean>? = null

        class MessageBean {
            /**
             * title : 樱花园6栋
             * detail : 位于樱花园6栋，进入老校门后上梯子左转朝里走，二教与马克思主义学院下面居民区石碑处，与京东快递相邻，收取时需提供手机尾号，收到短信后19：00前需前去领取快递，否则会退回包裹
             * photo : 3-3-1.JPG
             */

            var title: String? = null
            var detail: String? = null
            var photo: String? = null
        }
    }
}
